# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [12]:
s1 = pd.Series(np.random.randint(1, high=5, size=100))
s2 = pd.Series(np.random.randint(1, high=4, size=100))
s3 = pd.Series(np.random.randint(10000,high=30001, size=100))
s3

0     11743
1     13746
2     14766
3     12234
4     12221
      ...
95    15782
96    22057
97    28469
98    10647
99    16871
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [13]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  1  1  11743
1  1  1  13746
2  1  2  14766
3  2  3  12234
4  1  1  12221

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [16]:
housemkt.rename( columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [17]:
bigcolums = pd.concat([s1, s2, s3], axis=0)

In [18]:
bigcolums = bigcolums.to_frame()

In [19]:
bigcolums

        0
0       1
1       1
2       1
3       2
4       1
..    ...
95  15782
96  22057
97  28469
98  10647
99  16871

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [20]:
len(bigcolums)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [21]:
bigcolums.reset_index(drop=True, inplace= True)

In [22]:
bigcolums

         0
0        1
1        1
2        1
3        2
4        1
..     ...
295  15782
296  22057
297  28469
298  10647
299  16871

[300 rows x 1 columns]